Config/Catalogs/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДлинаНазначенияПлатежа</Name>
					<Comment>Максимальная длина поля "назначение платежа"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяПодписьПечататьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВтораяПодписьПечататьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельныйСрокИсполненияЗаявок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСчетаУчетныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоРПБС</Name>
					<Comment>Код по реестру получателей бюджетных средств</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗаполнятьПредельнуюДатуИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНаименованиеГРБС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьКодГлавы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНаименованиеБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьНаименованиеФинансовогоОргана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьКБК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьКОСГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельныйСчетГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтрактПоГОЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеОборонныеЗаказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КазначейскоеСопровождениеНаРазделах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьРазделПодраздел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьАналитическийКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВозможныОперацииВИностраннойВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодульИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаФорматов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкаФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ТипыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Казначейский</Name>
					<Comment>Лицевой счет открыт в органе казначейства или финансовом органе</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/МодулиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МодулиИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕБПАУБУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетИнтеграции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/СведенияОбОперацияхСоСредствамиВР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СведенияОбОперацияхСоСредствамиВР</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредыдущихСведений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УтверждаетсяГРБС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьУтвердившего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОУтвердившего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганКазначейства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Казначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НПА</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАктыОснованияВР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Catalogs/ЛицевыеСчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ЛицевойСчетПоНомеру(НомерЛС, Организация, ТипСчета = Неопределено, Создавать = Ложь) Экспорт  
	
	Если ТипСчета = Неопределено Тогда
		ТипСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский;
	КонецЕсли;
	
	ЛицевойСчет = ПредопределенноеЗначение("Справочник.ЛицевыеСчета.ПустаяСсылка");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Владелец = &Организация
	|	И ЛицевыеСчета.Код = &НомерСчета
	|	И ЛицевыеСчета.ТипЛицевогоСчета = &ТипЛицевогоСчета
	|	И НЕ ЛицевыеСчета.ПометкаУдаления";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерСчета", НомерЛС);  
	Запрос.УстановитьПараметр("ТипЛицевогоСчета", ТипСчета); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЛицевойСчет = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЛицевойСчет;
	
КонецФункции	

Функция НастройкиОбменаЛицевогоСчета(ЛицевойСчет) Экспорт  
	
	Возврат Новый ФиксированнаяСтруктура(ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛицевойСчет, "ВидОбмена, НастройкаФорматов"));
	
КонецФункции	

Функция ЛицевойСчетСМодулемИнтеграции(Организация, МодульИнтеграции = Неопределено, НаДату = Неопределено) Экспорт  
	
	Счет = Новый Структура;
	Счет.Вставить("ЛицевойСчет", Справочники.ЛицевыеСчета.ПустаяСсылка());
	Счет.Вставить("МодульИнтеграции", ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ПустаяСсылка"));
	
	Если НаДату = Неопределено Тогда
		НаДату = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ПустаяДата = '00010101000000'; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛицевыеСчета.Ссылка КАК Ссылка,
	|	ЛицевыеСчета.МодульИнтеграции КАК МодульИнтеграции
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Владелец = &Организация
	|	И ЛицевыеСчета.ДатаОткрытия <= &НаДату
	|	И (ЛицевыеСчета.ДатаЗакрытия = &ПустаяДата
	|			ИЛИ ЛицевыеСчета.ДатаЗакрытия >= &НаДату)");
	
	Если МодульИнтеграции = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
	|	И НЕ ЛицевыеСчета.МодульИнтеграции = ЗНАЧЕНИЕ(Перечисление.МодулиИнтеграции.ПустаяСсылка)
	|	И НЕ ЛицевыеСчета.МодульИнтеграции = ЗНАЧЕНИЕ(Перечисление.МодулиИнтеграции.НетИнтеграции)";
	Иначе
		Запрос.Текст = Запрос.Текст + "
	|	И ЛицевыеСчета.МодульИнтеграции = &МодулиИнтеграции";
	Запрос.УстановитьПараметр("МодулиИнтеграции", МодульИнтеграции);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
    |
	|УПОРЯДОЧИТЬ ПО
	|	ЛицевыеСчета.ДатаЗакрытия УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяДата", ПустаяДата);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Счет.Вставить("ЛицевойСчет", Выборка.Ссылка);
		Счет.Вставить("МодульИнтеграции", Выборка.МодульИнтеграции);
	КонецЕсли;
		
	Возврат Счет;
	
КонецФункции	

// Проверяет корректность указания номера лицевого счета
// 
// Параметры:
//  ЛицевойСчет - СправочникСсылка.Лицевые счета, проверяемый счет 
//  ТекстОшибки - возврашаемый параметр, содержит описание обнаруженных ошибок  
//  НомерЛС - Строка, Неопределено. Проверяемый номер счета, указывается, если 
//            номер счета не следует получать из реквизитов лицевого счета,
//            например, если проверка вызывается из формы незаписанного элемента
//  МодульИнтеграции - ПеречислениеСсылка.МодулиИнтеграции, Неопределено
//  Организация - СправочникСсылка.Организации, организация - владелец лицевого счета
//
// Возвращаемое значение:
//  Булево - Истина - номерсчета указан корректно, Лож - номер счета некорректен 
//
Функция НомерЛицевогоСчетаКорректен(ЛицевойСчет, ТекстОшибки, НомерЛС = Неопределено, МодульИнтеграции = Неопределено, Организация = Неопределено) Экспорт

#Область ИспрользуемыеДанные	 

	// Номер лицевого счета, за исключением номера лицевого счета в разрезе видов средств бюджетного 
	// (автономного) учреждения, номера лицевого счета получателя средств из бюджета субъекта Российской 
	// Федерации (местного бюджета), состоит из одиннадцати разрядов, где:
	//   1 и 2 разряды - код лицевого счета;
	//   3 и 4 разряды - первые два разряда кода органа Федерального казначейства, присвоенного Федеральным казначейством (далее - код по КОФК);
	//   5 разряд - код типа бюджета бюджетной системы Российской Федерации;
	//   6 - 10 разряд - учетный номер, соответствующий номеру клиента в реестровой записи Реестра участников бюджетного процесса, а также юридических лиц, не являющихся участниками бюджетного процесса (далее - Сводный реестр);
	//   11 разряд - контрольный разряд.
    //
	// Номер лицевого счета в разрезе видов средств бюджетного (автономного) учреждения, 
	// номер лицевого счета получателя средств из бюджета субъекта Российской Федерации 
	// (местного бюджета) состоит из одиннадцати разрядов, где:
	//   1-2  разряды - код лицевого счета;
	//   3    разряд - код типа бюджета бюджетной системы Российской Федерации;
	//   4-8  разряды - учетный номер, соответствующий номеру клиента в реестровой записи Сводного реестра;
	//   9-11 разряды - порядковый номер.   
	//
	// Код типа бюджета бюджетной системы Российской Федерации устанавливается в соответствии со следующими значениями:
	//   1 - федеральный бюджет;
	//   2 - бюджет субъекта Российской Федерации;
	//   3 - местный бюджет;
	//   4 - бюджет государственного внебюджетного фонда Российской Федерации;
	//   5 - бюджет территориального государственного внебюджетного фонда;  
	//
	// Номер клиента в реестровой записи Сводного реестра 
	//   1-2 разряды - код территории публично-правового образования,
	//   3   разряд -  первый разряд кода уровня бюджета
	//   4-8 разряды - номер организации в реестровой записи Сводного реестра
	//
	// Код уровня бюджета
	//	 10 - федеральный бюджет;
	//   20 - бюджет субъекта Российской Федерации;
	//   31 - бюджет городского округа;
	//   32 - бюджет муниципального района;
	//   33 - бюджет городского поселения;
	//   34 - бюджет сельского поселения;
	//   35 - бюджет городского округа с внутригородским делением;
	//   36 - бюджет внутригородского муниципального образования города федерального значения;
	//   37 - бюджет внутригородского района;
	//   38 - бюджет муниципального округа;
	//   41 - бюджет Фонда пенсионного и социального страхования Российской Федерации;
	//   43 - бюджет Федерального фонда обязательного медицинского страхования;
	//   50 - бюджет территориального государственного внебюджетного фонда 
	//
	// Элементы бюджета (из реквизита Бюджет справочника Организации
	//   01	Федеральный бюджет
	//   02	Бюджет субъекта Российской Федерации
	//   03	Бюджеты внутригородских муниципальных образований городов федерального значения
	//   04	Бюджет городского округа
	//   05	Бюджет муниципального района
	//   06	Бюджет Фонда пенсионного и социального страхования Российской Федерации
	//   07	Бюджет Фонда социального страхования Российской Федерации
	//   08	Бюджет Федерального фонда обязательного медицинского страхования
	//   09	Бюджет территориального фонда обязательного медицинского страхования
	//   10	Бюджет сельского поселения
	//   11	Бюджет городского округа с внутригородским делением
	//   12	Бюджет внутригородского района
	//   13	Бюджет городского поселения
	//   14	Бюджет муниципального округа  
	
	ЭлементБюджета_Уровень = Новый Соответствие; 
	ЭлементБюджета_Уровень.Вставить("01", "1");
	ЭлементБюджета_Уровень.Вставить("02", "2");
	ЭлементБюджета_Уровень.Вставить("03", "3");
	ЭлементБюджета_Уровень.Вставить("04", "3");
	ЭлементБюджета_Уровень.Вставить("05", "3");
	ЭлементБюджета_Уровень.Вставить("06", "4");
	ЭлементБюджета_Уровень.Вставить("08", "4");
	ЭлементБюджета_Уровень.Вставить("09", "5");
	ЭлементБюджета_Уровень.Вставить("10", "3");
	ЭлементБюджета_Уровень.Вставить("11", "3");
	ЭлементБюджета_Уровень.Вставить("12", "3");
	ЭлементБюджета_Уровень.Вставить("13", "3");
	ЭлементБюджета_Уровень.Вставить("14", "3");  
	
#КонецОбласти

	//90 2 Ц8086 000
	//47 2 Ц8086

	СчетКорректен = Истина;
	МассивОшибок = Новый Массив; 
	СтруктураПоказателей = Новый Структура;
	
	Если ОбщегоНазначения.СсылкаСуществует(ЛицевойСчет) Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛицевыеСчета.Код КАК НомерСчета,
		|	ЛицевыеСчета.МодульИнтеграции КАК МодульИнтеграции,
		|	Организации.КодПоРПБС КАК КодСВР,
		|	ПОДСТРОКА(Бюджеты.Код, 1, 2) КАК КодТерритории,
		|	ПРЕДСТАВЛЕНИЕ(Бюджеты.Элемент) КАК Элемент
		|ИЗ
		|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
		|			ПО Организации.Бюджет = Бюджеты.Ссылка
		|		ПО ЛицевыеСчета.Владелец = Организации.Ссылка
		|ГДЕ
		|	ЛицевыеСчета.Ссылка = &Ссылка");   
		
		Запрос.УстановитьПараметр("Ссылка", ЛицевойСчет); 
		Выборка = Запрос.Выполнить().Выгрузить();
		Если Выборка.Количество() > 0 Тогда
			СтруктураПоказателей = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка[0]); 
		КонецЕсли;  
		
	ИначеЕсли ЗначениеЗаполнено(Организация) И ОбщегоНазначения.СсылкаСуществует(Организация) Тогда 
	
	    Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.КодПоРПБС КАК КодСВР,
		|	ПОДСТРОКА(Бюджеты.Код, 1, 2) КАК КодТерритории,
		|	ПРЕДСТАВЛЕНИЕ(Бюджеты.Элемент) КАК Элемент
		|ИЗ
		| Справочник.Организации КАК Организации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
		|			ПО Организации.Бюджет = Бюджеты.Ссылка
		|ГДЕ
		|	Организации.Ссылка = &Ссылка");   
		
		Запрос.УстановитьПараметр("Ссылка", Организация); 
		Выборка = Запрос.Выполнить().Выгрузить();
		Если Выборка.Количество() > 0 Тогда
			СтруктураПоказателей = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка[0]); 
		КонецЕсли;  
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерЛС) Тогда
       СтруктураПоказателей.Вставить("НомерСчета", НомерЛС);
	КонецЕсли;   
	Если ЗначениеЗаполнено(МодульИнтеграции) Тогда
       СтруктураПоказателей.Вставить("МодульИнтеграции", МодульИнтеграции);
	КонецЕсли;
	
	Если СтруктураПоказателей.Количество() = 5 Тогда 
		// Проверяем только счета ЕБП
		Если СтруктураПоказателей.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ЕБПАУБУ") Тогда
			// Проверка номера ЛС
			Если СтрНайти("80,90,05", Лев(СтруктураПоказателей.НомерСчета, 2)) = 0 Тогда 
				МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неверный код л/с (разряды 1-2): ""%1"".'"), Лев(СтруктураПоказателей.НомерСчета, 2)) + Символы.ПС);
				СчетКорректен = Ложь;
			КонецЕсли;  
			Если НЕ СтрДлина(СокрЛП(СтруктураПоказателей.НомерСчета)) = 11 Тогда 
				МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Длина номера л/с должна составлять 11 знаков, текущая длина: ""%1"".'"), СокрЛП(СтруктураПоказателей.НомерСчета)) + Символы.ПС);
				СчетКорректен = Ложь;
			КонецЕсли; 
			Если НЕ Сред(СтруктураПоказателей.НомерСчета, 3, 1) = Сред(СтруктураПоказателей.КодСВР, 3, 1) Тогда 
				МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Код типа бюджета (разряд 3  л/с): ""%1"" не соответствует типу бюджета кода СВР организации: ""%2"".'"), 
				Сред(СтруктураПоказателей.НомерСчета, 3, 1), 
				Сред(СтруктураПоказателей.КодСВР, 3, 1)) + Символы.ПС);
				СчетКорректен = Ложь;
			КонецЕсли; 
			Если НЕ Сред(СтруктураПоказателей.НомерСчета, 4, 5) = Сред(СтруктураПоказателей.КодСВР, 4, 5) Тогда 
				МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Учетный номер клиента (разряды 4-8 л/с): ""%1"" не соответствует номеру организации в реестровой записи СВР: ""%2"".'"), 
				Сред(СтруктураПоказателей.НомерСчета, 4, 5), 
				Сред(СтруктураПоказателей.КодСВР, 4, 5)) + Символы.ПС);
				СчетКорректен = Ложь;
			КонецЕсли; 
			// Проверка кода СВР
			Если НЕ Лев(СтруктураПоказателей.КодСВР, 2) = СтруктураПоказателей.КодТерритории Тогда 
				МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Код территории ППО (разряды 1-2 кода СВР организации): ""%1"" не соответствует коду ОКТМО бюджета : ""%2"".'"), 
				Лев(СтруктураПоказателей.КодСВР, 2), СтруктураПоказателей.КодТерритории) + Символы.ПС);
				СчетКорректен = Ложь;
			КонецЕсли; 
			КодБюджета = ЭлементБюджета_Уровень.Получить(СтруктураПоказателей.Элемент);
			Если КодБюджета = Неопределено Или НЕ Сред(СтруктураПоказателей.КодСВР, 3, 1) = КодБюджета Тогда 
				МассивОшибок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Код бюджета (разряды 1-2 кода СВР организации): ""%1"" не соответствует элементу бюджета : ""%2"".'"), 
				Сред(СтруктураПоказателей.КодСВР, 3, 1), СтруктураПоказателей.Элемент));
				СчетКорректен = Ложь;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ СчетКорректен Тогда
		ТекстОшибки = Новый ФорматированнаяСтрока(МассивОшибок);
	КонецЕсли;
	
	Возврат СчетКорректен;
	
КонецФункции	



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру, содержащую свойства лицевого счета
//
Функция ПолучитьСвойстваЛицевогоСчета(ЛицевойСчетСсылка, Дата = Неопределено, СтруктураРеквизитов = Неопределено) Экспорт
	
	СвойстваЛицевогоСчета = Новый Структура;
	
	Если Дата = Неопределено ИЛИ Дата = '00010101000000' Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	ВозможныеПутиКДанным = Новый Структура;
	ВозможныеПутиКДанным.Вставить("ТипЛицевогоСчета");
	ВозможныеПутиКДанным.Вставить("МаксДлинаНазначенияПлатежа");
	ВозможныеПутиКДанным.Вставить("ПредельныйСрокИсполненияЗаявок");
	ВозможныеПутиКДанным.Вставить("НеЗаполнятьПредельнуюДатуИсполнения");
	ВозможныеПутиКДанным.Вставить("ИспользоватьДляСчетаУчетныйНомер");
	ВозможныеПутиКДанным.Вставить("КодПоРПБС");
	ВозможныеПутиКДанным.Вставить("ПерваяПодпись");
	ВозможныеПутиКДанным.Вставить("ВтораяПодпись");
	ВозможныеПутиКДанным.Вставить("ПерваяПодписьПечататьДолжность");
	ВозможныеПутиКДанным.Вставить("ВтораяПодписьПечататьДолжность");
	ВозможныеПутиКДанным.Вставить("ВалютаСчета"); 
	ВозможныеПутиКДанным.Вставить("МодульИнтеграции");
	
	Если СтруктураРеквизитов = Неопределено Тогда
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ТипЛицевогоСчета");
		СтруктураРеквизитов.Вставить("МаксДлинаНазначенияПлатежа");
		СтруктураРеквизитов.Вставить("ПредельныйСрокИсполненияЗаявок");
		СтруктураРеквизитов.Вставить("НеЗаполнятьПредельнуюДатуИсполнения");
		СтруктураРеквизитов.Вставить("ИспользоватьДляСчетаУчетныйНомер");
		СтруктураРеквизитов.Вставить("КодПоРПБС");
		СтруктураРеквизитов.Вставить("ПерваяПодпись");
		СтруктураРеквизитов.Вставить("ВтораяПодпись");
		СтруктураРеквизитов.Вставить("ПерваяПодписьПечататьДолжность");
		СтруктураРеквизитов.Вставить("ВтораяПодписьПечататьДолжность");
		СтруктураРеквизитов.Вставить("ВалютаСчета");
		СтруктураРеквизитов.Вставить("ПерваяПодписьДолжность");
		СтруктураРеквизитов.Вставить("ВтораяПодписьДолжность");
		СтруктураРеквизитов.Вставить("КазначействаЛС");  
		СтруктураРеквизитов.Вставить("МодульИнтеграции");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛицевойСчетСсылка) Тогда
		
		ПоляВыборки = "";
		
		Для каждого КлючЗначение из СтруктураРеквизитов Цикл
			
			Если ВозможныеПутиКДанным.Свойство(КлючЗначение.Ключ) Тогда
				
				ТекЗначение = КлючЗначение.Значение;
				Псевдоним = ?(ЗначениеЗаполнено(ТекЗначение), ТекЗначение, КлючЗначение.Ключ);
				
				
				ПоляВыборки = ПоляВыборки + "
				|	Справочник." + КлючЗначение.Ключ + " КАК " + Псевдоним + ", ";
				
			КонецЕсли;
			
		КонецЦикла;	
		
		ПоляВыборки = Лев(ПоляВыборки, СтрДлина(ПоляВыборки) - 2);
		
		ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
		|ИЗ Справочник.ЛицевыеСчета КАК Справочник
		|ГДЕ Справочник.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос(ТекстЗапроса);				
		Запрос.УстановитьПараметр("Ссылка", ЛицевойСчетСсылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Для каждого КлючЗначение из СтруктураРеквизитов Цикл
			Если ВозможныеПутиКДанным.Свойство(КлючЗначение.Ключ) Тогда
			ТекРеквизит = КлючЗначение.Значение;
			Псевдоним = ?(ЗначениеЗаполнено(ТекРеквизит), ТекРеквизит, КлючЗначение.Ключ);
			СвойстваЛицевогоСчета.Вставить(Псевдоним, Выборка[Псевдоним]);
			КонецЕсли;
		КонецЦикла;	
		
		Если СтруктураРеквизитов.Свойство("ПредельныйСрокИсполненияЗаявок") Тогда
			Псевдоним = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ПредельныйСрокИсполненияЗаявок), СтруктураРеквизитов.ПредельныйСрокИсполненияЗаявок, "ПредельныйСрокИсполненияЗаявок");
			СвойстваЛицевогоСчета[Псевдоним] = СвойстваЛицевогоСчета[Псевдоним] * 24 * 60 *60;
		КонецЕсли;	
		
		Если СтруктураРеквизитов.Свойство("ПерваяПодписьДолжность") Тогда
			Псевдоним = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ПерваяПодписьДолжность), СтруктураРеквизитов.ПерваяПодписьДолжность, "ПерваяПодписьДолжность");
			ИмяСсылки = "";
			ПризнакПечати = "";
			Если СтруктураРеквизитов.Свойство("ПерваяПодпись", ИмяСсылки) И СтруктураРеквизитов.Свойство("ПерваяПодписьПечататьДолжность", ПризнакПечати) Тогда
				ИмяСсылки = ?(ЗначениеЗаполнено(ИмяСсылки), ИмяСсылки, "ПерваяПодпись"); 
				ПризнакПечати = ?(ЗначениеЗаполнено(ПризнакПечати), ПризнакПечати, "ПерваяПодписьПечататьДолжность"); 
				СвойстваЛицевогоСчета.Вставить(Псевдоним, ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДолжностьСотрудника(СвойстваЛицевогоСчета[ИмяСсылки], СвойстваЛицевогоСчета[ПризнакПечати], Дата));
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураРеквизитов.Свойство("ВтораяПодписьДолжность") Тогда
			Псевдоним = ?(ЗначениеЗаполнено(СтруктураРеквизитов.ВтораяПодписьДолжность), СтруктураРеквизитов.ВтораяПодписьДолжность, "ВтораяПодписьДолжность");
			ИмяСсылки = "";
			ПризнакПечати = "";
			Если СтруктураРеквизитов.Свойство("ВтораяПодпись", ИмяСсылки)  И СтруктураРеквизитов.Свойство("ВтораяПодписьПечататьДолжность", ПризнакПечати) Тогда
				ИмяСсылки = ?(ЗначениеЗаполнено(ИмяСсылки), ИмяСсылки, "ВтораяПодпись"); 
				ПризнакПечати = ?(ЗначениеЗаполнено(ПризнакПечати), ПризнакПечати, "ВтораяПодписьПечататьДолжность"); 
				СвойстваЛицевогоСчета.Вставить(Псевдоним, ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДолжностьСотрудника(СвойстваЛицевогоСчета[ИмяСсылки], СвойстваЛицевогоСчета[ПризнакПечати], Дата));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("КазначействаЛС") Тогда
		Псевдоним = ?(ЗначениеЗаполнено(СтруктураРеквизитов.КазначействаЛС), СтруктураРеквизитов.КазначействаЛС, "КазначействаЛС");
		СвойстваЛицевогоСчета.Вставить(Псевдоним, ПлатежноРасчетныеДокументыПовтИсп.ПолучитьКазначействаЛицевогоСчета(ЛицевойСчетСсылка));
	КонецЕсли;
		
	Возврат СвойстваЛицевогоСчета;
	
КонецФункции

Функция ПолучитьЛицевойСчетПоУмолчанию(Знач Организация, Знач ИмяОбъекта, Знач Дата = Неопределено, Знач ТипСчета = Неопределено, 
	Знач ВалютаСчета = Неопределено, Знач ИмяЛС = "ЛицевойСчет") Экспорт
	
	СчетПоУмолчанию = Справочники.ЛицевыеСчета.ПустаяСсылка();
	                                                                          
	Если Дата = Неопределено ИЛИ Дата = '00010101000000' Тогда
		Дата = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;	
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Владелец = &Организация
	|	И ЛицевыеСчета.ДатаЗакрытия <= &ДатаЗакрытия
	|	И (ЛицевыеСчета.ТипЛицевогоСчета = &ТипСчета
	|			ИЛИ &ТипСчета = НЕОПРЕДЕЛЕНО)
	|	И (ЛицевыеСчета.ВалютаСчета = &ВалютаСчета
	|			ИЛИ &ВалютаСчета = НЕОПРЕДЕЛЕНО)
	|");
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ТипСчета", 		ТипСчета);
	Запрос.УстановитьПараметр("ДатаЗакрытия", 	Дата);
	Запрос.УстановитьПараметр("ВалютаСчета", 	?(ЗначениеЗаполнено(ВалютаСчета), ВалютаСчета, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат СчетПоУмолчанию;
		
    КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;

	КонецЕсли;	
	
	// Найдено более 1 счета, посмотрим, какой использовался в документе последний раз.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Док." + ИмяЛС + " КАК ЛицевойСчет
	|ИЗ
	|	" + ИмяОбъекта + " КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И Док.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата УБЫВ"; 
	
	Запрос.УстановитьПараметр("Организация", Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СчетПоУмолчанию = Выборка.ЛицевойСчет;
		
	КонецЕсли;

     Возврат СчетПоУмолчанию;
	
КонецФункции	

Функция ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Знач Организация, Знач ИмяОбъекта, Знач Дата = Неопределено, Знач ТипСчета = Неопределено, 
	Знач ВалютаСчета = Неопределено, Знач ИмяЛС = "ЛицевойСчет", Знач ИмяРекв = "РеквизитыЛицевогоСчета") Экспорт

	РеквизитыПоУмолчанию = Новый Структура;
	РеквизитыПоУмолчанию.Вставить("ЛицевойСчет", Справочники.ЛицевыеСчета.ПустаяСсылка());
	РеквизитыПоУмолчанию.Вставить("РеквизитыЛицевогоСчета", Справочники.РеквизитыЛицевыхСчетов.ПустаяСсылка());
	                                                                          
	Если Дата = Неопределено ИЛИ Дата = '00010101000000' Тогда
		Дата = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;	
	
	ОрганизацияДоп = Справочники.Организации.ПереопределитьОтборПоОрганизации(Организация);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	РеквизитыЛицевыхСчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|		ПО ЛицевыеСчета.Ссылка = РеквизитыЛицевыхСчетов.Владелец
	|ГДЕ
	|	(ЛицевыеСчета.Владелец = &Организация
	|			ИЛИ ЛицевыеСчета.Владелец = &ОрганизацияДоп)
	|	И ЛицевыеСчета.ДатаЗакрытия <= &ДатаЗакрытия
	|	И (ЛицевыеСчета.ТипЛицевогоСчета = &ТипСчета
	|			ИЛИ &ТипСчета = НЕОПРЕДЕЛЕНО)
	|	И (ЛицевыеСчета.ВалютаСчета = &ВалютаСчета
	|			ИЛИ &ВалютаСчета = НЕОПРЕДЕЛЕНО)
	|	И ЛицевыеСчета.ПометкаУдаления = ЛОЖЬ
	|	И РеквизитыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ОрганизацияДоп", ОрганизацияДоп);
	Запрос.УстановитьПараметр("ТипСчета", 		ТипСчета);
	Запрос.УстановитьПараметр("ДатаЗакрытия", 	Дата);
	Запрос.УстановитьПараметр("ВалютаСчета", 	?(ЗначениеЗаполнено(ВалютаСчета), ВалютаСчета, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат РеквизитыПоУмолчанию;
    КонецЕсли;
	
	Выборка = Результат.Выгрузить();
	
	Если Выборка.Количество() = 1 Тогда
		Если ЗначениеЗаполнено(ИмяРекв) И НЕ ЗначениеЗаполнено(Выборка[0].Ссылка) Тогда 
			Возврат РеквизитыПоУмолчанию;
	    КонецЕсли;
		РеквизитыПоУмолчанию.ЛицевойСчет 			= Выборка[0].ЛицевойСчет;
		РеквизитыПоУмолчанию.РеквизитыЛицевогоСчета = Выборка[0].Ссылка;
		Возврат РеквизитыПоУмолчанию; 
	Иначе
		МассивСчетов = Выборка.ВыгрузитьКолонку("ЛицевойСчет");
		МассивРазделов = Выборка.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;	
	
	// Найдено более 1-го счета, посмотрим, какой использовался в документе последний раз.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1";
	Если ЗначениеЗаполнено(ИмяЛС) Тогда
		Запрос.Текст = Запрос.Текст + "	
		|	Док." + ИмяЛС + " КАК ЛицевойСчет,"; 
	Иначе 
		Запрос.Текст = Запрос.Текст + "
		|	ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка) КАК ЛицевойСчет,";
	КонецЕсли;
	Если ЗначениеЗаполнено(ИмяРекв) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	Док." + ИмяРекв + " КАК РеквизитыЛицевогоСчета";
    Иначе
		Запрос.Текст = Запрос.Текст + "
		|	ЗНАЧЕНИЕ(Справочник.РеквизитыЛицевыхСчетов.ПустаяСсылка) КАК РеквизитыЛицевогоСчета";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|ИЗ
	|	" + ИмяОбъекта + " КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И Док.ПометкаУдаления = ЛОЖЬ";
	Если ЗначениеЗаполнено(ИмяЛС) Тогда 
		Запрос.Текст = Запрос.Текст + "	
		|	И Док." + ИмяЛС + " В (&МассивСчетов)"; 
		Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	КонецЕсли;
    Если ЗначениеЗаполнено(ИмяРекв) Тогда 
		Запрос.Текст = Запрос.Текст + "	
		|	И Док." + ИмяРекв + " В (&МассивРазделов)"; 
		Запрос.УстановитьПараметр("МассивРазделов", МассивРазделов);
	КонецЕсли;
    Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата УБЫВ"; 
	Запрос.УстановитьПараметр("Организация", Организация);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыПоУмолчанию.ЛицевойСчет 			= Выборка.ЛицевойСчет;
		РеквизитыПоУмолчанию.РеквизитыЛицевогоСчета = Выборка.РеквизитыЛицевогоСчета; 
		Возврат РеквизитыПоУмолчанию;
	КонецЕсли; 
	
	// Не было еще документов, это первый
	СписокКодовСчетов = Новый СписокЗначений;
	
	Если ИмяОбъекта = "Документ.ПлатежноеПоручение"
		ИЛИ ИмяОбъекта = "Документ.ЗаявкаНаВозврат"
		ИЛИ ИмяОбъекта = "Документ.ИзвещениеОНачисленииДоходов"
		ИЛИ ИмяОбъекта = "Документ.КассовоеПоступление"
		ИЛИ ИмяОбъекта = "Документ.КвитанцияНаОплатуГосуслуг"
		ИЛИ ИмяОбъекта = "Документ.НакладнаяНаРеализациюТорг12" 
		ИЛИ ИмяОбъекта = "Документ.СчетНаОплату"
		ИЛИ ИмяОбъекта = "Документ.АктОбОказанииУслуг"
		Тогда
		СписокКодовСчетов.Добавить("04");
	КонецЕсли;
	Если ИмяОбъекта = "Документ.ЗаявкаНаВозврат"
		ИЛИ ИмяОбъекта = "Документ.КассовоеПоступление"
		ИЛИ ИмяОбъекта = "Документ.СведенияОбОперацияхСоСредствамиВР" Тогда
		СписокКодовСчетов.Добавить("05");
	КонецЕсли;
	Если СписокКодовСчетов.Количество() = 0 Тогда
		СписокКодовСчетов.Добавить("03");
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РеквизитыЛицевыхСчетов.Владелец КАК Владелец,
	|	РеквизитыЛицевыхСчетов.Ссылка КАК Ссылка,
	|	РеквизитыЛицевыхСчетов.Владелец.Код КАК ВладелецКод
	|ИЗ
	|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|ГДЕ
	|	РеквизитыЛицевыхСчетов.КассовыйОрган ССЫЛКА Справочник.Казначейства
	|	И РеквизитыЛицевыхСчетов.КассовыйОрган.КазначействоИлиФО = 0
	|	И (РеквизитыЛицевыхСчетов.Владелец.Владелец = &Организация
	|			ИЛИ РеквизитыЛицевыхСчетов.Владелец.Владелец = &ОрганизацияДоп)
	|	И ПОДСТРОКА(РеквизитыЛицевыхСчетов.Владелец.Код, 1, 2) В (&СписокКодов)
	|	И РеквизитыЛицевыхСчетов.Владелец.ДатаЗакрытия <= &ДатаЗакрытия
	|	И РеквизитыЛицевыхСчетов.Владелец.ПометкаУдаления = ЛОЖЬ
	|	И РеквизитыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ОрганизацияДоп", ОрганизацияДоп);
	Запрос.УстановитьПараметр("СписокКодов", СписокКодовСчетов);
	Запрос.УстановитьПараметр("ДатаЗакрытия", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыПоУмолчанию.ЛицевойСчет 			= Выборка.Владелец;
		РеквизитыПоУмолчанию.РеквизитыЛицевогоСчета = Выборка.Ссылка; 
	КонецЕсли; 
	
	Возврат РеквизитыПоУмолчанию;
	
КонецФункции	

Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Владелец");
	Возврат МассивРеквизитов;	
КонецФункции

#КонецОбласти 

#КонецЕсли
